OpenFOAM_v2112/ChapterSample/chapter10_meshCreate/example8/system/sampling
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

planes
{
    type            surfaces;
    libs            (sampling);

        // Time control etc
    ${_visualization};

    fields          ( p U );

    // surfaceFormat   vtk;
    surfaceFormat   none;

    store           true;

    interpolationScheme cellPoint;

    _plane
    {
        type        plane; //cuttingPlane;
        planeType   pointAndNormal;
        interpolate false;

        pointAndNormalDict
        {
            point   (0 0 0);
            normal  (1 0 0);
        }
    }

    surfaces
    {
        plane0
        {
            ${_plane}
            pointAndNormalDict
            {
                point   (0 0 0);
            }
        }

        plane1
        {
            ${_plane}
            pointAndNormalDict
            {
                point   (-0.1 0 0);
            }
        }
    }

    #remove _plane
}


// ************************************************************************* //
